app/Controllers/Barang.php

SELECT *
FROM `tb_barang`
---
     public function show(){
         $m = new BarangModel();

         return view('barang/tampildata', [
             'data_barang' => $m->findAll()
         ]);