app/Controllers/Login.php

SELECT *
FROM `tb_admin`
WHERE `email` = 'dhofa.rizki@gmail.com'
AND `katasandi` = '0000'
 LIMIT 1
SELECT *
FROM `tb_pengguna`
WHERE `email` = 'lasts6082@gmail.com'
AND `katasandi` = '4444'
 LIMIT 1
---
    public function login()
    {
        $tingkat = request()->getPost('tingkat');
        if($tingkat == 'ADM'){
            $e = request()->getPost('email');
            $k = request()->getPost('katasandi');

            $m = new AdminModel();
            $r = $m->where('email', $e)
                ->where('katasandi', $k)->first();

            if($r == null){
                return "Login gagal";
            }else{
                session()->set('admin', $r);
                return redirect()->to(base_url('/'));
            }}
        elseif($tingkat == 'PGN'){
            $e = request()->getPost('email');
            $k = request()->getPost('katasandi');

            $m = new PenggunaModel();
            $r = $m->where('email', $e)
                ->where('katasandi', $k)->first();