app/Controllers/Pgndokter.php

SELECT *
FROM `tb_dokter`
---
    public function show()
    {
        $m = new DokterModel();

        return view('pgndokter/tampildata',[
            'data_dokter' => $m->findAll()
            ]);