app/Controllers/Pgngrooming.php

SELECT *
FROM `tb_grooming`
---
    public function show()
    {
        $m = new GroomingModel();

        return view('pgngrooming/tampildata',[
            'data_grooming' => $m->findAll()
            ]);