app/Controllers/Portofolio.php

SELECT *
FROM `tb_dokter`
---
    public function shows(){
        $m = new DokterModel();

        return view('folio/dokter', [
            'data_dokter' => $m->findAll()
        ]);

SELECT *
FROM `tb_grooming`
---
    public function showss(){
        $m = new GroomingModel();

        return view('folio/grooming', [
            'data_grooming' => $m->findAll()
        ]);